Merge pull request #49 from NeoLabHQ/docs/fix/links-usage
docs: remove flow chart diagrams
